[
  [
    "She said it was love at first sight.",
    "While she acknowledged the \"wedding\" had no legal bearing she did say it reflected her deep feelings toward the bottlenosed, 35-year-old object of her affection.",
    "It's just something that we did because I love him, but not in the way that you love a man.",
    "\"It's just a pure love that I have for this animal,\" she said."
  ],
  [
    "At a public ceremony, Tendler wore a white dress and placed flowers on her head to tie the knot with Cindy, who escorted by his fellow best-men dolphins swam over to his bride.",
    "Dressed in a white dress, a veil and pink flowers in her hair, Tendler got down on one knee on the dock and gave Cindy a kiss.",
    "The Jewish millionaire hugged him, whispered sweet nothings in his ear and kissed him in front of a cheering crowd.",
    "Cindy, escorted by his fellow best-men dolphins, swam over to Tendler and she hugged him, whispered sweet nothings in his ear, and kissed him in front of the cheering crowd.",
    "And so on Wednesday afternoon, the thrilled bride, wearing a white dress, walked down the dock before hundreds of astounded visitors and kneeled down before her groom, who was waiting in the water."
  ],
  [
    "Tendler met Cindy fifteen years ago, when she visited Eliat's dolphin reef.",
    "The groom, a resident of the Eilat dolphin reef, met Tendler 15 years ago, when she first visited the resort.",
    "JERUSALEM, Israel - Sharon Tendler met Cindy 15 years ago."
  ],
  [
    "Cindy was waiting in the water and after \"vows\" were exchanged, Sharon was tossed into the water by her friends so that she could swim with her new husband.",
    "After the ceremony was sealed with some mackerels, Tendler was tossed into the water by her friends so that she could swim with her new husband."
  ],
  [
    "Last week, she approached Cindy's trainer Maya Zilber with the extraordinary request.",
    "Tendler had received the approval of Cindy's trainer Maya Zilber for the unusual ceremony.",
    "Zilber accepted the challenge and \"talked the idea over with the fellow,\" who apparently consented."
  ],
  [
    "After a years-long romance, Tendler decided to embark on the highly unusual path of tying the knot with her beloved dolphin.",
    "Last week she finally took the plunge and proposed."
  ],
  [
    "Tendler, who said she imports clothes and promotes rock bands in England, has visited Israel several times a year since first meeting the dolphin.",
    "The British rock concert producer immediately had a liking for the mammal, and since then has been visiting the resort several times a year.",
    "The British rock concert producer took a liking to the dolphin and has made a habit of traveling to Eilat two or three times a year and spending time with her underwater sweetheart.",
    "Tendler, a British rock concert producer, met the Dolphin 15 years ago and developed a liking resulting in two to three annual visits every year to spend some time with her underwater love."
  ],
  [
    "\"It's not a bad thing.",
    "'I'm not a pervert'.",
    "\"It's not a perverted thing, I do love this dolphin, He's the love of my life,\" she said yesterday, upon her return to London.",
    "\"I'm the happiest girl on earth,\" the bride was cited as saying, \"I made a dream come true, and I am not a pervert,\" she has stressed.",
    "\"I'm the happiest girl on earth,\" the bride said as she choked back tears of emotion, \"I made a dream come true, and I am not a pervert,\" she stressed."
  ],
  [
    "Sharon Tendler, 41, and 35-aged male dolphin Cindy wed in Israel's Eliat resort Wednesday.",
    "In a modest ceremony at Dolphin Reef in the southern Israeli port of Eilat, Tendler, a 41-year-old British citizen, apparently became the world's first person to \"marry\" a dolphin.",
    "The touching ceremony took place at Dolphin Reef in the Israeli port of Eilat (which is, I guess, where the dolphin lives).",
    "A British woman has married a dolphin.",
    "A Jewish millionaire from London has married a male dolphin this week, according to reports.",
    "An unusual wedding ceremony was held in the southern resort town of Eilat on Wednesday, as Sharon Tendler, a 41-years-old Jewish millionaire from London married her beloved Cindy, a 35-year-old dolphin, Israel's leading newspaper Yedioth Ahronoth reported Thursday."
  ]
]